#include <iostream>
#include <string>
#include <windows.h>
#include <algorithm>
#include "Checker.cpp"

using namespace std;


//Переменные,Константы,Структуры
struct Sport {
string Name;
int DateGrounds;
string Inventory;
int HowManyInTeam;


};
int main()
{   //Включение русского языка
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    setlocale(LC_ALL,"Russian");


    int Size,NumberStruct,ExitStruct;
    Sport Sports[20];


    //шапка
    wcout<<L".---------------------------."<<endl;
    wcout<<L"|    Лабораторная № 7       |"<<endl;
    wcout<<L"|                           |"<<endl;
    wcout<<L"|   Фрайтог Илья ПКС 17-1   |"<<endl;
    wcout<<L".---------------------------."<<endl;
    wcout<<endl;

    wcout<<L".----------------------------------------------------------------------------------."<<endl;
    wcout<<L"|                         Введите размер не больше 20                              |"<<endl;
    wcout<<L".----------------------------------------------------------------------------------."<<endl;
    wcout<<L".----------------------------------------------------------------------------------."<<endl;;
    wcout<<L"|";
   /* while (!(cin >> Size) || (cin.peek() != '\n'))
    {
        cin.clear();
        while (cin.get() != '\n');
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                                 Ошибка                                           |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
    }*/
    Size=CheckNumber(Size);
    wcout<<L"                                                                                   |"<<endl;
    wcout<<L".----------------------------------------------------------------------------------."<<endl;
    if(Size<=0||Size>20)
     {
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                                 Ошибка                                           |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;

        return 1;

     }
    for(int i=0;i<Size;i++)
     {
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                             Введите Вид Спорта                                   | "<<endl;
        wcout<<L"|                               Пример: Футбол                                     |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        cin>>Sports[i].Name;
        wcout<<L"                                                                                   |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                      Введите Год Основания Спорта                                |"<<endl;
        wcout<<L"|                            Пример: 1992                                          |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        while (!(cin >> Sports[i].DateGrounds) || (cin.peek() != '\n'))
        {
            cin.clear();
            while (cin.get() != '\n');
            cout << "Error!" << endl;
        }
        wcout<<L"                                                                                   |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                             Введите Инвентарь Спорта                                   | "<<endl;
        wcout<<L"|                               Пример: Мяч                                     |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        cin>>Sports[i].Inventory;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                             Введите Сколько Игроков В Команде Спорта             | "<<endl;
        wcout<<L"|                                         Пример: 5                                |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        while (!(cin >> Sports[i].HowManyInTeam) || (cin.peek() != '\n'))
        {
            cin.clear();
            while (cin.get() != '\n');
            wcout<<L".----------------------------------------------------------------------------------."<<endl;
            wcout<<L"|                                 Ошибка                                           |"<<endl;
            wcout<<L".----------------------------------------------------------------------------------."<<endl;

     }
    }
    do{


    wcout<<L".----------------------------------------------------------------------------------."<<endl;
    wcout<<L"|                       Введите Номер Структуры и 0 для                            |"<<endl;
    wcout<<L"|                               Пример: 2                                          |"<<endl;
    wcout<<L".----------------------------------------------------------------------------------."<<endl;
    while (!(cin >> NumberStruct) || (cin.peek() != '\n'))
    {
        cin.clear();
        while (cin.get() != '\n');
        wcout<<L".----------------------------------------------------------------------------------."<<endl;
        wcout<<L"|                                 Ошибка                                           |"<<endl;
        wcout<<L".----------------------------------------------------------------------------------."<<endl;

 }

    ExitStruct=NumberStruct;
    if(NumberStruct>0){
    cout<<Sports[NumberStruct-1].Name<<endl;
    cout<<Sports[NumberStruct-1].DateGrounds<<endl;
    cout<<Sports[NumberStruct-1].HowManyInTeam<<endl;
    cout<<Sports[NumberStruct-1].Inventory<<endl;
    }
        }while(ExitStruct!=0);
    return 0;
    wcout<<L".----------------------------------------------------------------------------------."<<endl;
    wcout<<L"|                                   Вышел                                          |"<<endl;
    wcout<<L".----------------------------------------------------------------------------------."<<endl;

    return 1;
}
